
# โจทย์: แก้ไขโค้ดต่อไปนี้ให้ถูกต้อง
# โดยไม่ต้องเปลี่ยนแปลงฟังก์ชัน square
# และไม่ต้องเปลี่ยนแปลงการเรียกใช้ฟังก์ชัน square
# โดยให้ผลลัพธ์ที่ได้เป็น list ของค่าที่ได้จากการเรียกใช้ฟังก์ชัน square
# โดยใช้ฟังก์ชัน map
# โดยไม่ต้องใช้ for loop
# โดยให้ผลลัพธ์ที่ได้เป็น list ของค่าที่ได้จากการเรียกใช้ฟังก์ชัน square

"""
    def square(x):
        return x * x

    result = map(square, [1, 2, 3, 4])
    print(result)  # ทำไมไม่ได้ค่าที่ต้องการ?
"""

# คำตอบ: ใช้ list() ครอบฟังก์ชัน map เพื่อให้ได้ผลลัพธ์เป็น list
def square(x):
    return x * x

result = list(map(square, [1, 2, 3, 4]))
print(result)

